Import Neccessary Libraries

In [11]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

Import CSV File

In [12]:
# Load CSV from data folder
df = pd.read_csv('../data/4- gender-gap-education-levels.csv')

Explore Data File

In [13]:
df.head()

,Entity,Code,Year,"Combined gross enrolment ratio for tertiary education, female","Combined gross enrolment ratio for tertiary education, male","Combined total net enrolment rate, secondary, male","Combined total net enrolment rate, secondary, female","Combined total net enrolment rate, primary, female","Combined total net enrolment rate, primary, male"
0,Afghanistan,AFG,1986,0.62182,3.60227,NaN,NaN,NaN,NaN
1,Afghanistan,AFG,1990,1.40606,2.96306,NaN,NaN,NaN,NaN
2,Afghanistan,AFG,2003,0.51657,1.82170,NaN,NaN,NaN,NaN
3,Afghanistan,AFG,2004,0.51396,1.82145,NaN,NaN,NaN,NaN
4,Afghanistan,AFG,2009,1.41213,5.97378,NaN,NaN,NaN,NaN

In [14]:
df.columns

Index(['Entity', 'Code', 'Year',
       'Combined gross enrolment ratio for tertiary education, female',
       'Combined gross enrolment ratio for tertiary education, male',
       'Combined total net enrolment rate, secondary, male',
       'Combined total net enrolment rate, secondary, female',
       'Combined total net enrolment rate, primary, female',
       'Combined total net enrolment rate, primary, male'],
      dtype='object')

In [15]:
df.describe()

,Year,"Combined gross enrolment ratio for tertiary education, female","Combined gross enrolment ratio for tertiary education, male","Combined total net enrolment rate, secondary, male","Combined total net enrolment rate, secondary, female","Combined total net enrolment rate, primary, female","Combined total net enrolment rate, primary, male"
count,9228.000000,8251.000000,8251.000000,6538.000000,6538.000000,6855.000000,6855.000000
mean,1960.161032,19.170464,16.506685,32.055344,31.498507,53.364914,59.137355
std,60.482116,27.995750,21.995645,35.751953,37.043541,38.688078,37.319553
min,1820.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.010000
25%,1915.000000,0.000000,0.060000,0.140000,0.010000,6.920000,19.710000
50%,1991.000000,3.167690,5.653580,12.047725,6.580000,64.800030,74.000000
75%,2007.000000,30.156035,27.061165,69.839107,72.712023,90.564715,93.026330
max,2021.000000,152.656900,149.406390,100.000000,100.000000,100.000000,99.991820

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9228 entries, 0 to 9227
Data columns (total 9 columns):
 #   Column                                                         Non-Null Count  Dtype
---  ------                                                         --------------  -----
 0   Entity                                                         9228 non-null   object
 1   Code                                                           8562 non-null   object
 2   Year                                                           9228 non-null   int64
 3   Combined gross enrolment ratio for tertiary education, female  8251 non-null   float64
 4   Combined gross enrolment ratio for tertiary education, male    8251 non-null   float64
 5   Combined total net enrolment rate, secondary, male             6538 non-null   float64
 6   Combined total net enrolment rate, secondary, female           6538 non-null   float64
 7   Combined total net enrolment rate, primary, female             6855 non-null   float64
 8   Combined total net enrolment rate, primary, male               6855 non-null   float64
dtypes: float64(6), int64(1), object(2)
memory usage: 649.0+ KB

Essential DataType

In [17]:
df[['Entity','Code']]=df[['Entity','Code']].astype('category')

Checking Null Values

In [18]:
df.isnull().sum()

Entity                                                              0
Code                                                              666
Year                                                                0
Combined gross enrolment ratio for tertiary education, female     977
Combined gross enrolment ratio for tertiary education, male       977
Combined total net enrolment rate, secondary, male               2690
Combined total net enrolment rate, secondary, female             2690
Combined total net enrolment rate, primary, female               2373
Combined total net enrolment rate, primary, male                 2373
dtype: int64

Clean Data

In [19]:
# Define the columns to rename
rename_map = {
    'Combined gross enrolment ratio for tertiary education, female' : 'ter_female',
    'Combined gross enrolment ratio for tertiary education, male' : 'ter_male',
    'Combined total net enrolment rate, secondary, male': 'sec_male',
    'Combined total net enrolment rate, secondary, female': 'sec_female'
}

# Rename the columns first
df_renamed = df.rename(columns=rename_map)

# 3. Select ONLY the renamed columns AND any other columns you need (e.g., 'Entity', 'Year')
# You must include the original columns you want to keep, like 'Entity' and 'Year'.
# I'll assume you want 'Entity' and 'Year' based on common dataset structure.

desired_columns = ['Entity', 'Year', 'ter_female', 'ter_male', 'sec_male', 'sec_female'] 

df_clean = df_renamed[desired_columns]

In [20]:
print("Cleaned dataset shape:", df_clean.shape)
print("\nFirst few rows:")
print(df_clean.head())
print("\nColumn names:")
print(df_clean.columns.tolist())

Cleaned dataset shape: (9228, 6)

First few rows:
        Entity  Year  ter_female  ter_male  sec_male  sec_female
0  Afghanistan  1986     0.62182   3.60227       NaN         NaN
1  Afghanistan  1990     1.40606   2.96306       NaN         NaN
2  Afghanistan  2003     0.51657   1.82170       NaN         NaN
3  Afghanistan  2004     0.51396   1.82145       NaN         NaN
4  Afghanistan  2009     1.41213   5.97378       NaN         NaN

Column names:
['Entity', 'Year', 'ter_female', 'ter_male', 'sec_male', 'sec_female']

Keep only countries from Europe

In [ ]:
# The list of European countries
europe_countries = [
    'Albania', 'Andorra', 'Austria', 'Belarus', 'Belgium', 'Bosnia and Herzegovina',
    'Bulgaria', 'Croatia', 'Cyprus', 'Czechia', 'Denmark', 'Estonia', 'Finland', 
    'France', 'Germany', 'Greece', 'Hungary', 'Iceland', 'Ireland', 'Italy', 
    'Kosovo', 'Latvia', 'Liechtenstein', 'Lithuania', 'Luxembourg', 'Malta', 
    'Moldova', 'Monaco', 'Montenegro', 'Netherlands', 'North Macedonia', 'Norway', 
    'Poland', 'Portugal', 'Romania', 'Russia', 'San Marino', 'Serbia', 'Slovakia', 
    'Slovenia', 'Spain', 'Sweden', 'Switzerland', 'Ukraine', 'United Kingdom', 'Vatican' 
]

# Create a boolean mask and filter the DataFrame
df_europe = df_clean[df_clean['Entity'].isin(europe_countries)]

In [24]:
print(df_europe['Entity'].unique())

['Albania', 'Austria', 'Belarus', 'Belgium', 'Bosnia and Herzegovina', ..., 'Spain', 'Sweden', 'Switzerland', 'Ukraine', 'United Kingdom']
Length: 42
Categories (227, object): ['Afghanistan', 'Africa', 'Albania', 'Algeria', ..., 'World', 'Yemen', 'Zambia', 'Zimbabwe']